modules/payments-bridge/sear-payments-bridge-app/src/test/resources/requests/gtex_firco_alert.json

{
  "Header": null,
  "Body": {
    "msg_SendMessage": {
      "VersionTag": "1",
      "Authentication": {
        "UserLogin": "CASE_MGR_API_USER_S8",
        "UserPassword": "8JzH+aVV3cZjBOWUnitlB092cNzC28y+",
        "UserRealm": ""
      },
      "Messages": [
        {
          "Message": {
            "Hits": [
              {
                "Hit": {
                  "Tag": "50K",
                  "Score": "0.0",
                  "Blocking": true,
                  "Positions": [
                    {
                      "Position": {
                        "PositionEnd": "184",
                        "PositionStart": "181"
                      }
                    },
                    {
                      "Position": {
                        "PositionEnd": "184",
                        "PositionStart": "181"
                      }
                    }
                  ],
                  "EntityText": "CUBA",
                  "HittedEntity": {
                    "ID": "AS00010013",
                    "Type": "O",
                    "Codes": [],
                    "Names": [
                      {
                        "Name": "*"
                      }
                    ],
                    "Origin": "US_OFAC_ENH_LCTN",
                    "HideIDs": [],
                    "Keywords": [
                      {
                        "Keyword": "OS:OFAC"
                      }
                    ],
                    "Addresses": [
                      {
                        "Address": {
                          "Cities": [
                            {
                              "City": "*"
                            }
                          ],
                          "IsMain": "1",
                          "States": [],
                          "Countries": [
                            {
                              "Country": "CUBA"
                            },
                            {
                              "Country": "CUBA"
                            },
                            {
                              "Country": "CUBANA"
                            },
                            {
                              "Country": "KUBA"
                            },
                            {
                              "Country": "REPUBLIC OF CUBA"
                            },
                            {
                              "Country": "REPUBLICA DE CUBA"
                            }
                          ],
                          "PostalAddress": ""
                        }
                      }
                    ],
                    "HideUnits": [],
                    "UserData1": "",
                    "UserData2": "",
                    "HideInTags": [],
                    "Hyperlinks": [
                      {
                        "Hyperlink": "none"
                      }
                    ],
                    "Designation": "CUBA",
                    "HideOnlyIDs": [
                      {
                        "HideOnlyID": ""
                      }
                    ],
                    "HideOrigins": [],
                    "IsException": "0",
                    "Nationality": "",
                    "DatesOfBirth": [],
                    "PlacesOfBirth": [],
                    "AdditionalInfo": "74 main cities:\u0002ANTILLA, ARROYO NARANJO, ARTEMISA, \u0002BANES, BARACOA, BAYAMO, BOLONDRON, \u0002CAIBARIEN, CAMAGUEY, CARDENAS, CAYO LARGO, \u0002CIEGO DE AVILA, CIENFUEGOS, DIEZ DE OCTUBRE, GRANMA, \u0002GUAIMARO, GUANABO, GUANTANAMO, HABANA, \u0002HABANAS, HAVANA, HAVANNA, HOLGUIN, \u0002ISLE OF YOUTH, JIBACOA, L AVANA, LA HABANA, \u0002LA HAVANE, LAS TUNAS, LAVANA, MAISI, \u0002MANICARAGUA, MANZANILLO, MARIEL, MATANZAS, \u0002MAYABEQUE, MAYARI, NIQUERO, NUEVA GERONA, \u0002NUEVITAS, NUEVO VEDADO, PALMA SORIANO, PINAR DEL RIO, \u0002SAGUA LA GRANDE, SANCTI SPIRITUS, SANTA CLARA, SANTA CRUZ DEL SUR, \u0002SANTIAGO DE CUBA, TANAMO, VARADERO, VILLA CLARA, \u0002VINALES, YAGUAJAY, ΑΒΑΝΑ, ГАВАНА, \u0002هافانا, ハバナ, 哈瓦那, VERTIENTES, \u0002SAN JOSE DE LAS LAJAS, SAN ANTONIO DE LOS BANOS, PLACETAS, NICARO LEVISA, \u0002JOVELLANOS, JIGUANI, JATIBONICO, JAGUEY, \u0002GUINES, GUANAJAY, CONSOLACION DEL SUR, CAMAJUANI, \u0002CABAIGUAN, BAUTA, AMANCIO\u0002\u0002List ID: 1072 / Create Date: 11/13/1997 00:00:00 / Last Update Date: 09/24/2015 18:10:23 / Program: CUBA / OtherInformation: XLOC. OFAC maintains a sanctions program for Cuba. Please refer to the OFAC website for detailed information: http://www.treasury.gov/resource-center/sanctions/Programs/Pages/cuba.aspx",
                    "OfficialReferences": [
                      {
                        "OfficialReference": {
                          "Name": "2011-11-30 12:06:11 RBL"
                        }
                      }
                    ],
                    "HideSenderReceivers": []
                  },
                  "MatchingText": "Cuba, Cuba",
                  "RulesContext": {
                    "Info": "+10022019-AO+",
                    "Type": "1",
                    "Priority": "2",
                    "Confidentiality": "0"
                  },
                  "SolutionType": "6",
                  "SynonymIndex": "-1"
                }
              }
            ],
            "Unit": "US",
            "Amount": "6328.00",
            "Bypass": "0",
            "Actions": [
              {
                "Action": {
                  "Status": {
                    "ID": "0",
                    "Name": "FILTER",
                    "Checksum": "c4b4872d17cf6fa4f27f06e3b5d93c78",
                    "RoutingCode": "0"
                  },
                  "Comment": "Stop: 1, Nonblocking: 0",
                  "DateTime": "20211026105934",
                  "Operator": "Filter Engine"
                }
              },
              {
                "Action": {
                  "Status": {
                    "ID": "-2",
                    "Name": "NO HIT",
                    "Checksum": "1080a07f679004254edcc4854e8f66a7",
                    "RoutingCode": "-2"
                  },
                  "Comment": "Stop: 1, Nonblocking: 0",
                  "DateTime": "20211026105935",
                  "Operator": "Stripping Engine"
                }
              },
              {
                "Action": {
                  "Status": {
                    "ID": "224",
                    "Name": "FILTER_S8_PR",
                    "Checksum": "52e44434a2b046a6516c5f77a341d24c",
                    "RoutingCode": "12"
                  },
                  "Comment": "Auto decision",
                  "DateTime": "20211026105937",
                  "Operator": "DBCLient"
                }
              }
            ],
            "Command": "1",
            "Blocking": "1",
            "Currency": "CAD",
            "Priority": "2",
            "SystemID": "DIN20211026105931-00001-6739",
            "MessageID": "CECAA3ED-099D-52B9-E053-1B186C0A9833",
            "ValueDate": "2019/06/06",
            "CutoffTime": "20191230150000",
            "SenderCode": "SVBKUS60XXX\n",
            "CopyService": "",
            "CreatedDate": "2021/10/26 10:59:31",
            "IOIndicator": "O",
            "LastComment": "Suspect(s) detected by OFAC-Agent",
            "MessageData": "{1:F01SVBKUS60XXXX0000000000}{2:i103SVBKGB20XXXXN}{3:{108:TR2019060400023}{121:8b0097e7-3e1a-455d-aac0-1e222888d07d}}{4:\n:20:ABCOSP1123\n:23B:CRED\n:32A:190606CAD1221,26\n:50K:/995044\nCuba BAnk\nAddress 1 changed\nSan\nUSA\n:52D:/325858\nGood\n:53A:SVBKUS6S\n:57A:NOSCCATT 899172\n:59:/609062\nMILLER THOMSON LLP\nScotia 40 King West\nSuite 5800 PO Box 1011\nToronto ON MSH 351 Canada\n:70:/490060\n:71A:SHA\n:72:622893\n-}",
            "MessageType": "TFWIRE",
            "NonBlocking": "0",
            "BusinessType": "103",
            "BusinessUnit": "ROOT",
            "FilteredDate": "2021/10/26 10:59:34",
            "LastOperator": "OFAC-Agent",
            "NextStatuses": [
              {
                "Status": {
                  "ID": "203",
                  "Name": "ESC_TO_L2",
                  "Checksum": "a6bbe146cef0948076d7f62680312112",
                  "RoutingCode": "12"
                }
              }
            ],
            "ReceiverCode": "SVBKUS60XXX",
            "CurrentStatus": {
              "ID": "224",
              "Name": "FILTER_S8_PR",
              "Checksum": "52e44434a2b046a6516c5f77a341d24c",
              "RoutingCode": "12"
            },
            "MessageFormat": "SWIFT",
            "ToApplication": "",
            "ApplicationCode": "GTEX",
            "Confidentiality": "0",
            "SenderReference": "E1575821521090",
            "NormalizedAmount": "",
            "RelatedReference": "",
            "ApplicationPriority": "0"
          }
        }
      ]
    }
  }
}
